Intro = CreateDialog(function()

    Talk("", "이상한 미로, 이상한 구조, 이상한... 응?", "None")
    Talk("", "이건 네가 쓰던 코드다. 그래, 너는 지금 네 코드 안에 들어온 것이다.", "None")
    Talk("", "그것도 오늘이 마감일인 과제 코드에 말이다...", "None")
    Talk("", "너는 당장 빠져나와 과제를 해야한다는 의무감을 느낀다.", "None")
    Talk("", "하지만 어떻게 빠져나가야 할 지 모르는 너는 깊은 고민에 빠져본다.", "None")
    Talk("", "그렇게 한참을 고민하던 참, 너는 우연찮게 건너편에 사람이 있는 걸 본다.", "None")
    Talk("", "한 번 만나보는 게 좋을 거 같다.", "None")
    Talk("", "어쩌면 저들이 이 미로의 해답을 알고 있을지도 모르지.", "None")
    Talk("", "어찌 됐건... 힘내라!", "None")

    EndDialog(false, nil, "JavaScript", 0, "JS_1")
end)